/**********************DS18B20函数文件*********************************
*  晶振:12MHZ
******************************************************************/

/**********************包含文件*******************/
#include "DS18B20.h"
/********************************全局变量初始化********************************/ 


/******************************************************************************/
/* 函数名称  : DSRESTET                                                       */
/* 函数描述  : DS18B20发送控制信号                                            */
/* 输入参数  : void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void DSRESTET(void)       //发送控制信号
{
	uint i;
	DS = 0;
	i = 103;
	while(i > 0)i--;
	DS = 1;
	i = 4;
	while(i > 0)i--;
}
/******************************************************************************/
/* 函数名称  : TMP_READB                                                      */
/* 函数描述  : DS18B20读取一位数据                                            */
/* 输入参数  : void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
bit TMP_READB(void)       //读取每一位数据
{
   uint i;
   bit dat;
   DS = 0;i++;          //i++ 延时
   DS = 1;i++;i++;
   dat = DS;
   i = 8;while(i>0)i--;
   return (dat);
}
/******************************************************************************/
/* 函数名称  : TMP_READC                                                      */
/* 函数描述  : DS18B20读取一字节数据                                          */
/* 输入参数  : void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
uchar TMP_READC(void)   //读一字节数据
{
	uchar i,j,dat;
	dat = 0;
	for(i = 1;i <= 8;i++)
	{
		j = TMP_READB();
		dat = (j<<7)|(dat>>1);   //移位储存
	}
	return(dat);
}
/******************************************************************************/
/* 函数名称  : TMP_READROM                                                    */
/* 函数描述  : DS18B20未知                                                    */
/* 输入参数  : void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void TMP_READROM(void)          //读取数据
{
	uchar sn1,sn2;
	DSRESTET();
	TMP_Delay(2);
	TMP_WRITEC(0x33);
	sn1 = TMP_READC();
	sn2 = TMP_READC();
}

/******************************************************************************/
/* 函数名称  : TMP_WRITEC                                                     */
/* 函数描述  : DS18B20写入每字节                                              */
/* 输入参数  : void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void TMP_WRITEC(uchar dat)   //写入每字节进18B20
{
	uint i;
	uchar j;
	bit testb;
	for(j = 1; j <= 8; j++)
	{
		testb = dat&0x01;
		dat = dat>>1;
		if(testb)     //write 1
		{
			DS = 0;
			i++;i++;
			DS = 1;
			i = 8;while(i > 0)i--;
		}	    
		else
		{
			DS = 0;       //write 0
			i = 8;while(i > 0)i--;
			DS = 1;
			i++;i++;
		}
	
	}
}
/******************************************************************************/
/* 函数名称  : TMP_CHANGE                                                     */
/* 函数描述  : DS18B20发送控制信号                                            */
/* 输入参数  : void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void TMP_CHANGE(void)  //开始温度记录和数据转换
{
	DSRESTET();
	TMP_Delay(1);
	TMP_WRITEC(0xcc);  // 
	TMP_WRITEC(0x44);  //  写温度转换指令
}
/******************************************************************************/
/* 函数名称  : TMP                                                            */
/* 函数描述  : DS18B20温度采集函数                                            */
/* 输入参数  : void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : unsigned int  温度值                                           */
/******************************************************************************/
uint TMP(void)               //读寄存器数据和数值转换
{
	float tt;
	uint temp;
	uchar a,b;
	TMP_CHANGE();
	DSRESTET();    //发送控制信号
	TMP_Delay(1);
	TMP_WRITEC(0xcc);  //写入数据
	TMP_WRITEC(0xbe);
	a = TMP_READC();       //读取数据
	b = TMP_READC();
	temp = b;
	temp <<= 8;             //两字节计算温度
	temp = temp | a;
	tt = temp * 0.0625;
	temp = tt * 10 + 0.5;
	return temp;
}

/******************************************************************************/
/* 函数名称  : TMP_Delay                                                      */
/* 函数描述  : 延时XMS ms                                                     */
/* 输入参数  : unsigned int                                                   */
/* 参数描述  : 延时毫秒数                                                     */
/* 返回值    : 无                                                             */
/******************************************************************************/
void TMP_Delay(uint xms)
{
	uchar i;
	for( ; xms > 0; xms--)
		for(i = 120; i > 0; i--);
}


