/**********************DS18B20头文件*********************************
*  晶振:11.0592MHZ
*  2015年3月14日 15:52:35
*  DS端口
******************************************************************/
#ifndef __DS18B20
#define __DS18B20 1
/**********************包含文件*****************************************/
#include "HEAD.h"
/************************************位定义************************************/
sbit DS = P2^2;
/*********************************全局变量定义***********************************/  

/**********************************函数定义***********************************/
void DSRESTET(void);       //发送控制信号
bit TMP_READB(void);       //读取每一位数据
uchar TMP_READC(void);   //读一字节数据
void TMP_READROM(void);          //读取数据
void TMP_WRITEC(uchar dat);   //写入每字节进18B20
void TMP_CHANGE(void);  //开始温度记录和数据转换
void TMP_Delay(uint xms);       //延时ms

uint TMP(void);               //读寄存器数据和数值转换
#endif