/**********************PWM波函数文件*********************************
*  晶振:12MHZ
******************************************************************/

/**********************包含文件*******************/
#include "PWM.h"
/*********************************全局变初始化***********************************/  

#ifdef PWM_0
uint pwm_set_0 = 0,pwm_cycle_0 = 0;
/******************************************************************************/
/* 函数名称  : PWM_Init_0                                                     */
/* 函数描述  : PWM波0号定时器初始化 占用定时器0                               */
/* 输入参数  : Void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/	
void PWM_Init_0(void)//定时器初始化
{
	EA = 0;
	TMOD &= 0XF0;    //清除定时器0
	TMOD |= 0x01;    //初始化定时器
	PWM_Port0 = 1;//反相0
	TH0 = -(pwm_set_0 / 256); TL0= -(pwm_set_0 % 256);
	//EA = 1;
	ET0 = 1; TR0 = 1;
	
}
/******************************************************************************/
/* 函数名称  : PWM_Timer0                                                     */
/* 函数描述  : PWM波0号中断服务函数                                           */
/* 输入参数  : Void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/	
void PWM_Timer0(void) interrupt 1
{
	if(PWM_Port0 == 0)
	{
		TH0 = -(pwm_set_0 / 256); 
		TL0 = -(pwm_set_0 % 256);
		PWM_Port0 = 1;
	}//正向执行时间
	else
	{
		TH0 = -((pwm_cycle_0 - pwm_set_0) / 256); 
		TL0 = -((pwm_cycle_0 - pwm_set_0) % 256);
		PWM_Port0 = 0;
	}//空比执行时间
}
#endif


#ifdef PWM_1
uint pwm_set_1 = 0,pwm_cycle_1 = 0;
/******************************************************************************/
/* 函数名称  : PWM_Init_1                                                     */
/* 函数描述  : PWM波1号定时器初始化 占用定时器1                               */
/* 输入参数  : Void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/		
void PWM_Init_1(void)//定时器初始化
{
	EA = 0;
	TMOD &= 0X0F;    //清除定时器1
	TMOD |= 0x10;    //初始化定时器
	PWM_Port1 = 1;//反相0
	TH1 = -(pwm_set_1 / 256); TL1= -(pwm_set_1 % 256);
	EA = 1;
	ET1 = 1; TR1 = 1;
	
}
/******************************************************************************/
/* 函数名称  : PWM_Timer1                                                     */
/* 函数描述  : PWM波1号中断服务函数                                           */
/* 输入参数  : Void                                                           */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/	
void PWM_Timer1(void) interrupt 3 
{
	if(PWM_Port1 == 0)
	{
		TH1 = -(pwm_set_1 / 256); 
		TL1 = -(pwm_set_1 % 256);
		PWM_Port1 = 1;
	}//正向执行时间
	else
	{
		TH1 = -((pwm_cycle_1 - pwm_set_1) / 256); 
		TL1 = -((pwm_cycle_1 - pwm_set_1) % 256);
		PWM_Port1 = 0;
	}//空比执行时间
}
#endif
 